ParFiles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-04 Sun 15:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Belgarath" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9d77a1e">1. Project Parameter File</a></li>
<li><a href="#orgd7626b2">2. Unit 100 - Test Unit 1</a>
<ul>
<li><a href="#org903c4d0">2.1. Digital Status Indicators</a></li>
<li><a href="#org7822680">2.2. Digital Alarm Indicators</a></li>
<li><a href="#org3ce5d67">2.3. Analog Status Indicators</a></li>
</ul>
</li>
<li><a href="#org084830e">3. Unit 200 - Test Unit 2</a>
<ul>
<li><a href="#orgd8a95a1">3.1. Digital Status Indicators</a></li>
<li><a href="#org3e8a90f">3.2. Digital Alarm Indicators</a></li>
<li><a href="#org338fdc8">3.3. Analog Status Indicators</a></li>
</ul>
</li>
<li><a href="#org285c9fe">4. Unit 300 - Test Unit 3</a>
<ul>
<li><a href="#orgd40a541">4.1. Digital Status Indicators</a></li>
<li><a href="#org4d1b0d9">4.2. Digital Alarm Indicators</a></li>
<li><a href="#org1c07bf6">4.3. Analog Status Indicators</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is a test to see if multiple units could be placed in an org file in a way to document a FactoryTalk parameter file.
</p>

<div id="outline-container-org9d77a1e" class="outline-2">
<h2 id="org9d77a1e"><span class="section-number-2">1</span> Project Parameter File</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-conf-unix">
!=====
! Please see ParFiles.org to make any changes to this parameter file
!=====

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7626b2" class="outline-2">
<h2 id="orgd7626b2"><span class="section-number-2">2</span> Unit 100 - Test Unit 1</h2>
<div class="outline-text-2" id="text-2">
<p>
Use parameter number range 100
</p>
</div>
<div id="outline-container-org903c4d0" class="outline-3">
<h3 id="org903c4d0"><span class="section-number-3">2.1</span> Digital Status Indicators</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Use parameter numbers 100 -1 10
</p>

<div class="org-src-container">
<pre class="src src-conf-unix">
#100=U100_running
#101=U100_alm

</pre>
</div>
</div>
</div>

<div id="outline-container-org7822680" class="outline-3">
<h3 id="org7822680"><span class="section-number-3">2.2</span> Digital Alarm Indicators</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Use parameter numbers 111-120
</p>

<div class="org-src-container">
<pre class="src src-conf-unix">
#111=U100_heat_alm
#112=U100_ol_alm

</pre>
</div>
</div>
</div>

<div id="outline-container-org3ce5d67" class="outline-3">
<h3 id="org3ce5d67"><span class="section-number-3">2.3</span> Analog Status Indicators</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Use parameter numbers 121-130 
</p>

<div class="org-src-container">
<pre class="src src-conf-unix">
#121=U100_amps
#122=U100_rpm

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org084830e" class="outline-2">
<h2 id="org084830e"><span class="section-number-2">3</span> Unit 200 - Test Unit 2</h2>
<div class="outline-text-2" id="text-3">
<p>
Use parameter number range 200
</p>
</div>
<div id="outline-container-orgd8a95a1" class="outline-3">
<h3 id="orgd8a95a1"><span class="section-number-3">3.1</span> Digital Status Indicators</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Use parameter numbers 200-210
</p>

<div class="org-src-container">
<pre class="src src-conf-unix">
#200=U200_running
#201=U200_alm

</pre>
</div>
</div>
</div>

<div id="outline-container-org3e8a90f" class="outline-3">
<h3 id="org3e8a90f"><span class="section-number-3">3.2</span> Digital Alarm Indicators</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Use parameter numbers 211-220
</p>

<div class="org-src-container">
<pre class="src src-conf-unix">
#211=U200_heat_alm
#212=U200_ol_alm

</pre>
</div>
</div>
</div>

<div id="outline-container-org338fdc8" class="outline-3">
<h3 id="org338fdc8"><span class="section-number-3">3.3</span> Analog Status Indicators</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Use parameter numbers 221-230
</p>

<div class="org-src-container">
<pre class="src src-conf-unix">
#221=U200_amps
#222=U200_rpm

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org285c9fe" class="outline-2">
<h2 id="org285c9fe"><span class="section-number-2">4</span> Unit 300 - Test Unit 3</h2>
<div class="outline-text-2" id="text-4">
<p>
Use parameter number range 300
</p>
</div>
<div id="outline-container-orgd40a541" class="outline-3">
<h3 id="orgd40a541"><span class="section-number-3">4.1</span> Digital Status Indicators</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Use parameter numbers 300-310
</p>

<div class="org-src-container">
<pre class="src src-conf-unix">
#300=U300_running
#301=U300_alm

</pre>
</div>
</div>
</div>

<div id="outline-container-org4d1b0d9" class="outline-3">
<h3 id="org4d1b0d9"><span class="section-number-3">4.2</span> Digital Alarm Indicators</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Use parameter numbers 311-320
</p>

<div class="org-src-container">
<pre class="src src-conf-unix">
#311=U300_heat_alm
#312=U300_ol_alm

</pre>
</div>
</div>
</div>

<div id="outline-container-org1c07bf6" class="outline-3">
<h3 id="org1c07bf6"><span class="section-number-3">4.3</span> Analog Status Indicators</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Use parameter numbers 321-330
</p>

<div class="org-src-container">
<pre class="src src-conf-unix">
#321=U300_amps
#322=U300_rpm

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Belgarath</p>
<p class="date">Created: 2021-07-04 Sun 15:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
